

/*
 * 2.15 월
 * 4,5 매치 판단여부 수정 ->현재 직접 매치만 가능, 네모 모양 매치 판단 기능 추가
 * 블록들 체력 부여하기
 * 
 * 2.16 화
 * UI 구성 작업 : 스테이지 준비 씬, 로딩 씬
 * 
 * 2.17 수 작업
 * Level 스크립트 Scriptable Object의 Custom Inspector 작업 완료
 * 
 * 
 * 2.18 목 작업 예정
 * 싱글톤 구현 -> 현재 Level에 대한 정보를 가져오는 스크립트 구현
 * 1. 스테이지 선택 시 해당 미션에 대한 정보를 가져 올 수 있도록 구현
 *    - 홀수, 짝수 판단 및 미션 블록들에 대한 이름을 가지고 판단해야함 -> 딕셔너리 사용예정
 *    - 스테이지 진입 시에도 해당 미션 내용들 가져 올 수 있도록 구현 
 *    
 * 
 * 2.19 금 작업
 * 인 게임 미션 정보 UI 프로토 타입 구현
 * 
 * 
 * 2.22 월 작업
 * 인 게임 미션 정보 UI 정리 및 받아오기 구현
 * 
 * 2.24 수 작업
 * 인 게임 미션 정보 업데이트 반영하기 Goal Manager 작성완료
 * 
 * 
 * 작업 예정
 * 게임 진행 중 실패 UI 성공 UI 구현
 * 
 * 메인 화면 궁수의 전설 스타일 UI로 변경하기
 * 게임 진행 중 다시하기 -> 현재 씬 리로드 구현?
 * 
 * 인 게임시 해당 스테이지 데이터 가져오기
 * 데이터 가져오면서 현재 스테이지에 대한 정보 입력에 대한 내용 가공
 * 
 * 
 * 
 * 스테이지 진입하기
 * 데이터 저장/불러오기

 * 특수블록들은 어떻게 생길지 기획해보기
 * 힌트 매니저 수정
 */

